{"config": [{"config": {"dtype": "float32", "name": "conv2d_1", "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_regularizer": null, "filters": 32, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_regularizer": null, "filters": 64, "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 64, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 1, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow"}